Задачи на if-else

1. Определение знака числа
   Задача:
   Напишите программу, которая принимает с консоли число и проверяет:
   Если число больше 0, выведите "Число положительное".
   Если меньше 0 — "Число отрицательное".
   Если равно 0 — "Число равно нулю".
   Методы и конструкции:
   Scanner
   if, else if, else
   System.out.println()

2. Поиск наибольшего из двух чисел
   Задача:
   Создайте программу, которая принимает два числа и выводит наибольшее из них.
   Методы и конструкции:
   Scanner
   if-else или Math.max()
   System.out.println()

3. Вывод оценки по шкале 1–5
   Задача:
   Программа принимает число от 1 до 5 и выводит текстовое описание оценки:
   5 — "Отлично"
   4 — "Хорошо"
   3 — "Удовлетворительно"
   2 или 1 — "Неудовлетворительно"
   Методы и конструкции:
   Scanner
   switch-case или if-else if
   System.out.println()

4. Проверка на чётность
   Задача:
   Напишите программу, которая проверяет, является ли введённое число чётным или нечётным.
   Методы и конструкции:
   Scanner
   if-else, оператор %
   System.out.println()

5. Определение размера скидки по возрасту
   Задача:
   Напишите программу, которая определяет размер скидки:
   До 18 лет — 25%
   От 65 и старше — 30%
   Остальные — без скидки
   Методы и конструкции:
   Scanner
   if, else if, else
   System.out.println()

6. Оценка результата теста по баллам
   Задача:
   Программа принимает число — результат теста (0–100) и выводит:
   90 и выше — "Отлично"
   75–89 — "Хорошо"
   60–74 — "Удовлетворительно"
   ниже 60 — "Неудовлетворительно"
   Методы и конструкции:
   Scanner
   if, else if, else
   System.out.println()


Задачи на switch

1. Вывод дня недели по номеру
   Задача:
   Реализуйте программу, которая принимает с консоли число от 1 до 7 и выводит название соответствующего дня недели (например, 1 — "Понедельник").
   Методы и конструкции:
   Scanner
   switch-case
   System.out.println()
   default (для обработки некорректного ввода)

2. Стоимость билета по дню недели
   Задача:
   Определите стоимость билета в кино:
   будние дни (1–5) — 300 рублей
   выходные (6–7) — 450 рублей
   Методы и конструкции:
   Scanner
   switch-case (можно несколько case подряд) или if-else
   System.out.println()

3. Перевод числовых оценок в буквенные (A–F)
   Задача:
   Программа принимает число от 0 до 100 и переводит его в буквенную оценку по шкале:
   90–100 — A
   80–89 — B
   70–79 — C
   60–69 — D
   ниже 60 — F
   Методы и конструкции:
   Scanner
   if-else if или switch-case
   System.out.println()

4. Обработка текстовых команд
   Задача:
   Программа читает строку: "start", "stop", "restart" или "status". Для каждой команды нужно вывести соответствующее сообщение, например: "Система запущена".
   Методы и конструкции:
   Scanner (nextLine())
   switch-case по String
   System.out.println()
   default

5. Простой калькулятор с использованием switch
   Задача:
   Программа принимает два числа и оператор (+, -, *, /), затем выполняет операцию и выводит результат.
   Методы и конструкции:
   Scanner
   switch-case
   if для проверки деления на 0
   System.out.println()
   Арифметические операторы +, -, *, /


Задачи на for

1. Вывод чисел от 1 до 100, делящихся на 3
   Задача:
   Напишите программу, которая выводит все числа от 1 до 100, которые делятся на 3.
   Методы и конструкции:
   for
   оператор %
   if
   System.out.println()

2. Сумма чисел от 1 до n
   Задача:
   Реализуйте программу, которая принимает с консоли число n и вычисляет сумму всех чисел от 1 до n.
   Методы и конструкции:
   Scanner
   for
   переменная int sum = 0
   System.out.println()

3. Таблица умножения для числа
   Задача:
   Создайте программу, которая выводит таблицу умножения для числа, введённого пользователем.
   Методы и конструкции:
   Scanner
   for
   System.out.println()
   арифметические операторы

4. Проверка на простое число
   Задача:
   Напишите программу, которая проверяет, является ли введённое число простым. Простое число делится только на 1 и на само себя.
   Методы и конструкции:
   Scanner
   for
   if-else
   логическая переменная (boolean isPrime = true)
   System.out.println()

5. Вывод чисел от 1 до 10
   Задача:
   Напишите программу, которая выводит числа от 1 до 10 на экран.
   Методы и конструкции:
   for
   System.out.println()


Задачи на while

1. Вычисление факториала с помощью while
   Задача:
   Напишите программу, которая принимает с консоли число и выводит его факториал (произведение всех чисел от 1 до n), используя цикл while.
   Методы и конструкции:
   Scanner
   while
   переменные int result = 1, int i = 1
   System.out.println()

2. Вывод всех чётных чисел до заданного
   Задача:
   Реализуйте программу, которая выводит все чётные числа от 1 до числа, введённого пользователем.
   Методы и конструкции:
   Scanner
   while
   if, оператор %
   System.out.println()

3. Обратный отсчёт от введённого числа до 1
   Задача:
   Создайте программу, которая принимает с консоли положительное число и выводит обратный отсчёт от него до 1.
   Методы и конструкции:
   Scanner
   while
   System.out.println()
   декремент number--

Задачи на do-while

1. Запрос положительного числа
   Задача:
   Напишите программу, которая запрашивает у пользователя число и продолжает спрашивать, пока оно не станет положительным.
   Методы и конструкции:
   Scanner
   do-while
   System.out.println()
   условие number <= 0

2. Проверка пароля
   Задача:
   Реализуйте программу, которая запрашивает у пользователя пароль, пока он не введёт верный (пароль заранее задан в коде).
   Методы и конструкции:
   Scanner
   do-while
   метод .equals() для строк
   System.out.println()

3. Вывод чисел от 1 до 10 с использованием do-while
   Задача:
   Создайте программу, которая выводит числа от 1 до 10, используя do-while.
   Методы и конструкции:
   переменная-счётчик i
   do-while
   System.out.println()

4. Завершение программы по команде "exit"
   Задача:
   Напишите программу, которая будет ждать ввода команды "exit" от пользователя для завершения работы.
   Методы и конструкции:
   Scanner
   do-while
   метод .equals()
   System.out.println()

5. Подсчёт количества цифр в числе
   Задача:
   Напишите программу, которая подсчитывает, сколько цифр в целом числе, введённом пользователем.
   Методы и конструкции:
   Scanner
   do-while
   деление / 10
   count++
   условие для 0


Задачи на break и continue

1. Сумма чисел до первого отрицательного (использовать break)
   Задача:
   Напишите программу, которая запрашивает у пользователя числа и выводит их сумму. Программа завершает выполнение, если пользователь вводит отрицательное число.
   Методы и конструкции:
   Scanner
   while (true)
   break
   переменная sum
   System.out.println()

2. Пропуск чисел, делящихся на 3 (использовать continue)
   Задача:
   Создайте программу, которая выводит числа от 1 до 20, пропуская те, которые делятся на 3.
   Методы и конструкции:
   for
   if, оператор %
   continue
   System.out.println()

3. Вывод только положительных чисел (использовать continue)
   Задача:
   Напишите программу, которая принимает ряд чисел от пользователя и выводит только положительные. Отрицательные числа нужно пропускать.
   Методы и конструкции:
   Scanner
   while или do-while
   if, continue
   System.out.println()

4. Ввод строк до команды "stop" (использовать break)
   Задача:
   Программа должна запрашивать строки у пользователя и завершаться только тогда, когда введена команда "stop".
   Методы и конструкции:
   Scanner
   while (true)
   метод .equals("stop")
   break
   System.out.println()
